1.3 Arts

# I have no idea where they got this 1% from but in our data we just have 26 digital/all and 74 physical

1.3.1 Who engages with the arts?

# Adults engagement in the arts by age 

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-age#dataset>
PREFIX sr: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-age#dimension/survey-topic>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-age#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?survey ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs sr: [ rdfs:label ?survey] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?survey in ('Adults engagement with the arts in the last 12 months by demographics (digital)', 'Adults engagement with the arts in the last 12 months by demographics (physical)')) .	
      }
            
ORDER BY ?response

# Art Engagement Physical

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dataset>
PREFIX sr: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dimension/survey-topic>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?survey ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs sr: [ rdfs:label ?survey] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?survey = 'Adults engagement with the arts in the last 12 months by demographics (physical)' && !regex(?response, "ITL")) .	
      }
            
ORDER BY ?response

# Art Engagement - Digital 

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dataset>
PREFIX sr: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dimension/survey-topic>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?survey ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs sr: [ rdfs:label ?survey] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?survey = 'Adults engagement with the arts in the last 12 months by demographics (digital)' && !regex(?response, "ITL")) .	
      }
            
ORDER BY ?response

# Adults engagement in the arts by ethnicity

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-ethnicity#dataset>
PREFIX sr: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-ethnicity#dimension/survey-topic>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-ethnicity#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?survey ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs sr: [ rdfs:label ?survey] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?survey in ('Adults engagement with the arts in the last 12 months by demographics (digital)', 'Adults engagement with the arts in the last 12 months by demographics (physical)')) .	
      }
            
ORDER BY ?response

# Barriers to engagement with the arts (physical)

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-the-arts-in-the-last-12-months-physical#dataset>
PREFIX ques: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-the-arts-in-the-last-12-months-physical#dimension/question>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-the-arts-in-the-last-12-months-physical#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?question ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs ques: [ rdfs:label ?question] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?question = 'Barriers to engaging with the arts in the last 12 months') .	
      }
            
ORDER BY ?response

# Barriers to engagement with the arts (digital)

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-the-arts-in-the-last-12-months-digital#dataset>
PREFIX ques: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-the-arts-in-the-last-12-months-digital#dimension/question>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-the-arts-in-the-last-12-months-digital#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?question ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs ques: [ rdfs:label ?question] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?question = 'Barriers to engaging with the arts online') .	
      }
            
ORDER BY ?response

1.4 Libraries

# Physical Engagement with Libraries by type

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-libraries-in-the-last-12-months-physical#dataset>
PREFIX ques: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-libraries-in-the-last-12-months-physical#dimension/question>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-libraries-in-the-last-12-months-physical#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?question ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs ques: [ rdfs:label ?question] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?question = 'Activity done whilst visiting the library in the last 12 months') .	
      }
            
ORDER BY ?response

# Digital engagement with libraries by type

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-libraries-in-the-last-12-months-digital#dataset>
PREFIX ques: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-libraries-in-the-last-12-months-digital#dimension/question>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-libraries-in-the-last-12-months-digital#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?question ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs ques: [ rdfs:label ?question] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?question = 'Activities done online') .	
      }
            
ORDER BY ?response

1.4.1 Who engages with library services?

# Libray Engagement - Physical 

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dataset>
PREFIX sr: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dimension/survey-topic>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?survey ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs sr: [ rdfs:label ?survey] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?survey = 'Adults engagement with libraries in the last 12 months by demographics (physical)' && !regex(?response, "ITL")) .	
      }

# Libray Engagement - Digital 

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dataset>
PREFIX sr: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dimension/survey-topic>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?survey ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs sr: [ rdfs:label ?survey] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?survey = 'Adults engagement with libraries in the last 12 months by demographics (digital)' && !regex(?response, "ITL")) .	
      }

1.4.2 Barriers to engaging

1.5 Heritage

# Again, I dont know where they got the distinction between only digital and both, I can;t find this 2% value

# Digital Heritage Engagement by activity type

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-heritage-sites-in-the-last-12-months-digital#dataset>
PREFIX ques: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-heritage-sites-in-the-last-12-months-digital#dimension/question>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-heritage-sites-in-the-last-12-months-digital#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?question ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs ques: [ rdfs:label ?question] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?question = 'Activities done online') .	
      }
            
ORDER BY ?response

1.5.1 Who engaged with heritage sites?

# Heritage engagement - physical 

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dataset>
PREFIX sr: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dimension/survey-topic>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?survey ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs sr: [ rdfs:label ?survey] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?survey = 'Adults engagement with heritage sites in the last 12 months by demographics (physical)' && !regex(?response, "ITL")) .	
      }
            
ORDER BY ?response

# Heritage engagement - digital

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dataset>
PREFIX sr: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dimension/survey-topic>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-region#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?survey ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs sr: [ rdfs:label ?survey] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?survey = 'Adults engagement with heritage sites in the last 12 months by demographics (digital)' && !regex(?response, "ITL")) .	
      }
            
ORDER BY ?response

# Physical Heritage Engagement by Index of Multiple Deprivation

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-index-of-multiple-deprivation#dataset>
PREFIX sr: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-index-of-multiple-deprivation#dimension/survey-topic>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-index-of-multiple-deprivation#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?survey ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs sr: [ rdfs:label ?survey] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?survey = 'Adults engagement with heritage sites in the last 12 months by demographics (physical)') .	
      }
            
ORDER BY ?response

# Digital Heritage Engagement by Index of Multiple Deprivation

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-index-of-multiple-deprivation#dataset>
PREFIX sr: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-index-of-multiple-deprivation#dimension/survey-topic>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-index-of-multiple-deprivation#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?survey ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs sr: [ rdfs:label ?survey] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?survey = 'Adults engagement with heritage sites in the last 12 months by demographics (digital)') .	
      }
            
ORDER BY ?response

# Heritage engagement by long standing illness or disability 

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
PREFIX data:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-long-standing-illness-or-disability#dataset>
PREFIX sr: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-long-standing-illness-or-disability#dimension/survey-topic>
PREFIX res: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-long-standing-illness-or-disability#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>
SELECT DISTINCT ?survey ?response ?percentage
WHERE {
       ?obs qb:dataSet data: . 
       ?obs sr: [ rdfs:label ?survey] .
       ?obs res: [ rdfs:label ?response ] .	 
       ?obs measure: ?percentage .	
FILTER(?survey in ('Adults engagement with heritage sites in the last 12 months by demographics (digital)', 'Adults engagement with heritage sites in the last 12 months by demographics (physical)')) .	
      }
            
ORDER BY ?response

1.5.2 Barriers to engaging

1.6 Museums and Galleries

# Physical museum and gallery and heritage engagement

PREFIX qb: <http://purl.org/linked-data/cube#>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
PREFIX data1:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-heritage-sites-in-the-last-12-months-physical#dataset>
PREFIX ques1: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-heritage-sites-in-the-last-12-months-physical#dimension/question>
PREFIX res1: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-heritage-sites-in-the-last-12-months-physical#dimension/response>
PREFIX data2:<http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-museums-in-the-last-12-months-physical#dataset>
PREFIX ques2: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-museums-in-the-last-12-months-physical#dimension/question>
PREFIX res2: <http://gss-data.org.uk/data/participation-survey/dcms-participation-survey-2021-22-annual-data-tables/participation-survey-by-adults-engagement-with-museums-in-the-last-12-months-physical#dimension/response>
PREFIX measure: <http://gss-data.org.uk/def/measure/percentage-of-responses>

SELECT ?question ?response ?percentage
WHERE { 
		{
			?obs qb:dataSet data1: . 
        	?obs ques1: [ rdfs:label ?question] .
        	?obs res1: [ rdfs:label ?response ] .	 
        	?obs measure: ?percentage .
		}
UNION
	    {
			?obs qb:dataSet data2: . 
       		?obs ques2: [ rdfs:label ?question] .
       		?obs res2: [ rdfs:label ?response ] .	 
       		?obs measure: ?percentage .	
        }
filter( ?question in ('How often have you engaged with museums in the last 12 months?', 'How often have you visited a heritage site in the last 12 months')) .
}
ORDER BY ?response
